import React from 'react';
import '../styles/about.css';

const About = () => {
  return (
    <div className="container about-container">
      {/* Фото ліворуч */}
      <div className="about-photo">
        <img src="images/bio/bio.jpg" alt="Моє фото" />
      </div>

      {/* Текст праворуч */}
      <div className="about-text">
        <h1>Про мене</h1>
        <p>
          Мене звати Макс, я веб-розробник. Працюю з <b>HTML, CSS, JavaScript</b>, а також сучасними
          фреймворками, такими як <b>React</b> та <b>Spring Boot</b>. 
        </p>
        <p>
          У своїй роботі поєдную фронтенд і бекенд, створюючи <i>повноцінні веб-додатки</i>, які 
          зручно використовувати як звичайним користувачам, так і бізнесу.
        </p>
        <p>
          Також займаюся навчанням та удосконаленням своїх навичок у сфері <b>баз даних</b>, 
          <b> алгоритмів</b> та <b>об’єктно-орієнтованого програмування</b>.
        </p>
        <p>
          Якщо ви хочете співпрацювати зі мною, сміливо пишіть через форму зворотного зв’язку 
          на сайті!
        </p>
        
      </div>
    </div>
  );
};

export default About;
