import React from 'react';
import '../styles/about.css';

const About = () => {
    return (
        <div className="container about-container">
            {/* Фото ліворуч */}
            <div className="about-photo">
                <img src="images/bio/bio.jpg" alt="Моє фото" />
            </div>

            {/* Текст праворуч */}
            <div className="about-text">
                <h1>Про мене</h1>
                <p>


                    Мене звати Максим, народився 10 Лютого 2006 року у місті <b>Сміла</b>.
                    Моє дитинство минуло у в тихому районі імені <b>Богдана Хмельницького</b>, де я з ранніх років навчився цінувати сім'ю.
                </p>
                <p>
                    Мій батько помер в автокатастрофі, тому я ріс під опікою моєї матері та бабусі.
                    Мої батьки завжди були для мене прикладом працьовитості та турботи про рідних.
                    Саме завдяки їхній підтримці я зростав з вірою у себе та вмінням долати труднощі.
                </p>
                <p>
                    Свою освіту я розпочав у 2013 році у Смілянській міській школі №7.
                    Навчання дало мені не лише знання, а й розуміння того, що успіх приходить до тих, хто не зупиняється перед перешкодами.
                </p>
                <p>
                    Після школи я вступив до Черкаського Державного Технологічного університету(ЧДТУ), де обрав спеціальність Інженерія програмного забезпечення.
                    Це рішення стало для мене важливим кроком у майбутнє.
                </p>
                <p>
                    Окрім навчання, я цікавлюся скульптурою та писанням творів.
                    Вільний час намагаюся присвячувати саморозвитку та спілкуванню з друзями.
                </p>

            </div>
            <div className="about-text2">
                <p>
                    Наразі я веб-розробник. Працюю з <b>HTML, CSS, JavaScript</b>, а також сучасними
                    фреймворками, такими як <b>React</b> та <b>Spring Boot</b>.
                </p>
                <p>
                    У своїй роботі поєдную фронтенд і бекенд, створюючи <i>повноцінні веб-додатки</i>, які
                    зручно використовувати як звичайним користувачам, так і бізнесу.

                    Також займаюся навчанням та удосконаленням своїх навичок у сфері <b>баз даних</b>,
                    <b> алгоритмів</b> та <b>об’єктно-орієнтованого програмування</b>.
                </p>
                <p>
                    Якщо ви хочете співпрацювати зі мною, сміливо пишіть через форму зворотного зв’язку
                    на сайті!
                </p>
            </div>
        </div>
    );
};

export default About;
